# ForwardIterator Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ModelCurveArray..::..ForwardIterator Method
ModelCurveArray Class See Also
---
Retrieve a forward moving iterator to the array.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ModelCurveArrayIterator ForwardIterator()
```

Visual Basic
---
```text
Public Overridable Function ForwardIterator As ModelCurveArrayIterator
```

Visual C++
---
```text
public:
virtual ModelCurveArrayIterator^ ForwardIterator()
```

# ### Return Value
Returns a forward moving iterator to the array.
# See Also
ModelCurveArray Class
Autodesk.Revit.DB Namespace